Revit 2025 API
Document.NewPointBoundaryConditions Method
 Creates a new Point BoundaryConditions Element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public BoundaryConditions NewPointBoundaryConditions(
	Reference reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
Public Function NewPointBoundaryConditions (
	reference As Reference,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double,
	X_Rotation As TranslationRotationValue,
	X_RotationSpringModulus As Double,
	Y_Rotation As TranslationRotationValue,
	Y_RotationSpringModulus As Double,
	Z_Rotation As TranslationRotationValue,
	Z_RotationSpringModulus As Double
) As BoundaryConditions
public:
BoundaryConditions^ NewPointBoundaryConditions(
	Reference^ reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
member NewPointBoundaryConditions :
        reference : Reference *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float *
        X_Rotation : TranslationRotationValue *
        X_RotationSpringModulus : float *
        Y_Rotation : TranslationRotationValue *
        Y_RotationSpringModulus : float *
        Z_Rotation : TranslationRotationValue *
        Z_RotationSpringModulus : float -> BoundaryConditions
Parameters
reference Reference
 A Geometry reference to a Beam's, Brace's or Column's analytical line end.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation TranslationRotationValue
 A value indicating the option for rotation about the X axis.
X_RotationSpringModulus Double
 Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation TranslationRotationValue
 A value indicating the option for rotation about the Y axis.
Y_RotationSpringModulus Double
 Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation TranslationRotationValue
 A value indicating the option for rotation about the Z axis.
Z_RotationSpringModulus Double
 Rotation Spring Modulus for Z axis. Ignored if Y_Rotation is not "Spring".
Return Value
BoundaryConditions
If successful, NewPointBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 0 - "Point". null is returned if the operation fails.
Remarks
This method will only function with the Autodesk Revit Structure application.
Example
bool CreatePointBoundaryCondition(Autodesk.Revit.DB.Document document, AnalyticalMember column)
{
   // Get the start point reference of the column
   Reference startReference = null;
   if (null != column)
   {
      AnalyticalModelSelector selector = new AnalyticalModelSelector(column.GetCurve(), AnalyticalCurveSelector.StartPoint);
      startReference = column.GetReference(selector);
   }
   else
   {
      throw new Exception("Cannot get end point for selected column");
   }
   // Get the Revit creation document
   Autodesk.Revit.Creation.Document docCreation = document.Create;
   // Create the Point Boundary Conditions for the start point
   BoundaryConditions condition = docCreation.NewPointBoundaryConditions(startReference,
                                                                         TranslationRotationValue.Fixed, 0,
                                                                         TranslationRotationValue.Fixed, 0,
                                                                         TranslationRotationValue.Fixed, 0,
                                                                         TranslationRotationValue.Fixed, 0,
                                                                         TranslationRotationValue.Fixed, 0,
                                                                         TranslationRotationValue.Fixed, 0);
   if (null == condition)
   {
      throw new Exception("Can't create the point boundary condition for selected column start point.");
   }
   // Give the user some information
   TaskDialog.Show("Revit", "Point boundary condition created successfully.");
   return (null != condition);
}
Private Function CreatePointBoundaryCondition(document As Autodesk.Revit.DB.Document, column As FamilyInstance) As Boolean
    ' Get the start point reference of the column
    Dim startReference As Reference = Nothing
 Dim analyticalModel As Autodesk.Revit.DB.Structure.AnalyticalElement = Nothing
 Dim relManager As Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager = Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager(document)
 If (relManager Is Nothing) Then
    Return False
 End If
 Dim counterpartId As ElementId = relManager.GetAssociatedElementId(column.Id)
 If (counterpartId Is Nothing) Then
    Return False
 End If
 analyticalModel = document.GetElement(counterpartId)
 If analyticalModel IsNot Nothing Then
    Dim selector As AnalyticalModelSelector = New AnalyticalModelSelector(analyticalModel.GetCurve(), AnalyticalCurveSelector.StartPoint)
    startReference = analyticalModel.GetReference(selector)
 Else
    Throw New Exception("Cannot get end point for selected column")
    End If
    ' Get the Revit creation document
    Dim docCreation As Autodesk.Revit.Creation.Document = document.Create
    ' Create the Point Boundary Conditions for the start point
    Dim condition As BoundaryConditions = docCreation.NewPointBoundaryConditions(startReference, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, _
        0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, _
        0)
    If condition Is Nothing Then
        Throw New Exception("Can't create the point boundary condition for selected column start point.")
    End If
    ' Give the user some information
    TaskDialog.Show("Revit", "Point boundary condition created successfully.")
    Return (condition IsNot Nothing)
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace